In [12]:
data = {
    "Name": [
        "Sport Club Corinthians Paulista",
        "São Paulo Futebol Club",
        "Santos Futebol Club",
        "Sociedade Esportiva Palmeiras"
    ],
    "Year": [1910, 1930, 1902, 1914],
    "Mascot": ["Mosqueteiro", "Um Velho", "Uma Sardinha", "A Pepa Pig"]
}

In [6]:
import pandas as pd

## Convertendo um dicionário para um DataFrame:

In [18]:
df_sp_teams = pd.DataFrame(data)
df_sp_teams

                              Name  Year        Mascot
0  Sport Club Corinthians Paulista  1910   Mosqueteiro
1           São Paulo Futebol Club  1930      Um Velho
2              Santos Futebol Club  1902  Uma Sardinha
3    Sociedade Esportiva Palmeiras  1914    A Pepa Pig

In [19]:
print(type(df_sp_teams))

<class 'pandas.core.frame.DataFrame'>

## Acessando uma coluna em especifica do nosso DataFrame (Series):

In [8]:
df_sp_teams['Name']

0    Sport Club Corinthians Paulista
1             São Paulo Futebol Club
2                Santos Futebol Club
3      Sociedade Esportiva Palmeiras
Name: Name, dtype: object

### A tipagem também muda:

In [11]:
print(type(df_sp_teams['Name']))

<class 'pandas.core.series.Series'>

## Acessando multiplas colunas do nosso DataFrame:

In [17]:
# Uma vez que eu tenho mais de uma coluna é um DataFrame. Series é quando temos apenas uma coluna
df_sp_teams[["Name", "Mascot"]]

                              Name        Mascot
0  Sport Club Corinthians Paulista   Mosqueteiro
1           São Paulo Futebol Club      Um Velho
2              Santos Futebol Club  Uma Sardinha
3    Sociedade Esportiva Palmeiras    A Pepa Pig

## Vendo detalhes do nosso DataFrame:

In [20]:
df_sp_teams.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Year    4 non-null      int64
 2   Mascot  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

## O describe:

In [24]:
df_sp_teams.describe()

# O .describe() descreve dados sobre as colunhas numéricas do nosso DataFrame

              Year
count     4.000000
mean   1914.000000
std      11.775681
min    1902.000000
25%    1908.000000
50%    1912.000000
75%    1918.000000
max    1930.000000

In [23]:
# Para ver dados sobre as colunas não numéricas, podemos utilizar:

df_sp_teams.describe(exclude="number")

                                   Name       Mascot
count                                 4            4
unique                                4            4
top     Sport Club Corinthians Paulista  Mosqueteiro
freq                                  1            1